#_*_ coding:utf8 _*_

# 说明以下代码
# dsdfsf
# sdfsdfd
# fsdfsdf
# sdffs

#注释可以增强代码的可读性
#可以作为调试用
#提高团队的合作效率

#我是单行注释                   沙发斯蒂芬         额
# 防辐射服
# 时代大厦所


'''
    这里就是多行注释
    我还是会被注释掉
    因为我在三引号里面
    多行注释 通过 三引号来实现
'''

"""
    我也是多行注释
    一可以注样释多行

print('上面的内容都被注释了')

a = -1
if a > 0:
    print('我是if里面的代码块')#条件不成立不会执行 不会执行if里面的代码块

print('我是if里面的代码块')#这里会被输出
"""

'''
    变量
    变量是用来存储数据的。
    
'''

a = 1  #把数字 1 存储到了 a 变量里面
b = 2
c = '我是帅哥'   #
print(a)
print(b) #报 nameError 错误 因为 没有定义变量 b  当定义了这个变量之后就不会报错
print(c)



